;*****************************************************************
; Задание: В заданном массиве у чисел инвертировать 0,1,4,7 биты, а так же поменять местами 0 и 1, 2 и 3, 4 и 7, 5 и 6 биты
;*****************************************************************

SDATA SEGMENT WORD PUBLIC 'DATA'
ARRAY_X	DB 120,1,22,134,212,51			; - массив чисел X
ARRAY_Y	DB 6  DUP(0)					; - массив чисел Y
SDATA ENDS

;*****************************************************************
; определение  области стека
;*****************************************************************

SSTACK SEGMENT PARA STACK 'STACK'
DW 64 DUP (?)
STACK_POINT LABEL WORD
SSTACK ENDS

;*****************************************************************
; определение программного сегмента
;*****************************************************************

SCODE SEGMENT WORD PUBLIC 'CODE'
ASSUME CS:SCODE,DS:SDATA,SS:SSTACK

START:  MOV AX,SDATA					;запись сегментного адреса
MOV DS,AX								;данных в регистр DS
										; Инициализация исходных данных		
MOV SI,0								; SI содержит индексы массивов X и Y
MOV CX,6								; СX:= число элементов массива X
										; Начало цикла
M1:	MOV AL,ARRAY_X[SI] 					; Занесение очередного элемента
MOV AH,AL
SHR AH,1
AND AH,055H
SHL AL,1
AND AL,0AAH
OR  AL,AH
MOV BL,AL
SHL BL,2
AND BL,0C0H
MOV AH,AL
SHR AH,2
AND AH,030H
AND AL,00FH
OR  AL,AH
OR  AL,BL

XOR AL,10010011B

MOV ARRAY_Y[SI],AL						; Запись в массив Y
INC SI									; Увеличение SI на 1
LOOP M1	

MOV AX,4C00H							;-	выход из программы
INT 21H									;	выполняется функция DOS, номер которой находится в AH
SCODE   ENDS							;- конец кодового сегмента программы
END START								;- конец программы
